// Generated file by using converter.js and vanjs-converter
import van from "vanjs-core";
import { goto, Route } from "vanjs-router";

import '../style.css'

const {h1,h2,hr,p} = van.tags;

export const SummaryOf25Title = () => {
    return van.tags.section(van.tags.div(
        { class: "content-title" },
        van.tags.a({class: "router", onclick: () => {goto("SummaryOf25")}}, van.tags.h2("SummaryOf25")),
    ));
}

export const SummaryOf25 = () => {
    
    return van.tags.main({class: "blog"},
        van.tags.div(
    h1(   "Summary of 2025", ), hr(), p(   "年末的最后一天想起更新一下自己的神秘网站，再加上申请到了一个免费的域名，成为Cloudflare的走狗()，决定稍稍更新一下，记录一下自己今年到底摸了多少🐟，干了啥事吧。", ), h2(   "2025-12-31", ), p(   "跟一个朋友开发了一个软件暂命名为MusicPractice，说是给他练习视唱练耳的小软件，目前进度基本完成和弦听写，和部分节奏练习，但是一直在放鸽子，导致节奏练习到现在也没做的很完善，但是至少把基本的渲染音符SVG的问题解决了，只能说还是的离屏渲染，当时在想这部分时候真是愁了半天，最后找的VexFlow开源库用于音符渲染，感觉还不错，但是还是好复杂，哎还在慢慢学习怎么使用()笑死。\n然后就是6，7，8月份一直在北京出差导致有时间写上面那个软件，但是一直也没学习什么新技术，而且代码也没怎么写哎，真是折磨，那段时间抹平了我对北京的最后幻想，感觉北京只能给我带来无尽的痛苦(虽然后来去迎接朋友，去了西单购买二次元小商品还是很开心)。\n回来之后莫名其妙开始研究了ffmpeg，我的评价是学了，但是跟没学差不多，只能说基本了解点ffmpeg 的基本编解码流程，但是具体到每个协议都是什么，还是有点太复杂了，而且编码过程感觉很依赖ai，导致长时间不写就有点忘了，也导致我跳槽想找音视频方向的工作，但是却没什么自信(就会这点有自信就怪了)。\n说点展望，虽然现在公司很悠闲，但是感觉赚的稍微有点不知足，想跳槽，不知道来年能不能找到合适的，然后帮我朋友把他那个神秘MusicPractice软件稍微在完善一下(他还想要加LLM实现自动填写和声题，导致我还要去学习一下基本的Encoder Only的LLM)，希望能有所推进吧，他还帮我找了个清华计算机大哥，让大哥帮我一键完成哈哈哈。\n年末了大家都吃点好的，我吃披萨🍕，最后还是住我和大家2026年万事如意吧。\nThx", ),));
}

export const SummaryOf25Router = () => {
    return Route({
          rule: "SummaryOf25",
          Loader: () => {
            return SummaryOf25();
          }
    })
}

